src/main/resources/clientDetail-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
				xmlns:cmec="http://www.childmaintenance.gsi.gov.uk/futurescheme/interfaces/CMECGetClientDetailsWebService">
   <soapenv:Header/>
   <soapenv:Body>
      <cmec:getClientDetails>
         <getClientDetailsInput>
            <!--Optional:-->
            <RequestHeader>
               <!--Optional:-->
               <serviceName>?</serviceName>
               <!--Optional:-->
               <operation>?</operation>
               <!--Optional:-->
               <reqSystemName>?</reqSystemName>
               <!--Optional:-->
               <originatorID>?</originatorID>
               <!--Optional:-->
               <originatorIP>?</originatorIP>
               <!--Optional:-->
               <sourceObjectId>?</sourceObjectId>
               <!--Optional:-->
               <branchNumber>?</branchNumber>
               <!--Optional:-->
               <seqNum>?</seqNum>
               <!--Optional:-->
               <timeStamp>?</timeStamp>
               <!--Optional:-->
               <sensitiveAccessFlag>?</sensitiveAccessFlag>
               <!--Optional:-->
               <hostName>?</hostName>
            </RequestHeader>
            <SCIN>100000000010</SCIN>
         </getClientDetailsInput>
      </cmec:getClientDetails>
   </soapenv:Body>
</soapenv:Envelope>
